ANSI-Common-LISP/docs/exercise-6.md


# exercise-6

1.  [Define a version of tokens&#x2026;](#org5153ead)
2.  [Define a version of `bin-searc`&#x2026;](#orgf4afb31)
3.  [Define a function that takes&#x2026;](#org4f221fc)
4.  [Modify `most` (page 105) to return,&#x2026;](#org077d3cf)
5.  [Define `remove-if` (no keywords) in terms of `filter` (page 105).](#org5ef7317)
6.  [Define a function that takes&#x2026;](#orgaa60163)
7.  [Define a function that takes one&#x2026;](#org2f62a36)
8.  [Suppose `expensive` is a function&#x2026;](#org69e8ff7)
9.  [Define a function like `apply`,&#x2026;](#org5f885a9)


<a id="org5153ead"></a>

## Define a version of tokens&#x2026;

1.Define a version of `tokens` (page 67) that takes `:test` and `:start` arguments defaulting to `#'constituent` and 0 respectively.


<a id="orgf4afb31"></a>

## Define a version of `bin-searc`&#x2026;

2.Define a version of `bin-search` (page 60) that takes `:key`, `:test`, `:start`, and `:end` arguments with the usual meanings and defaults.


<a id="org4f221fc"></a>

## Define a function that takes&#x2026;

3.Define a function that takes any number of arguments and returns the
number of arguments passed to it.


<a id="org077d3cf"></a>

## Modify `most` (page 105) to return,&#x2026;

4.Modify `most` (page 105) to return, as two values, the two highest-scoring elements of a list.


<a id="org5ef7317"></a>

## Define `remove-if` (no keywords) in terms of `filter` (page 105).


<a id="orgaa60163"></a>

## Define a function that takes&#x2026;

6.Define a function that takes one argument, a number, and returns the greatest argument passed to it so far.


<a id="org2f62a36"></a>

## Define a function that takes one&#x2026;

7.Define a function that takes one argument, a number, and returns true if it is greater than the argument passed to the function the last time it was called. The function should return `nil` the first time it is called.


<a id="org69e8ff7"></a>

## Suppose `expensive` is a function&#x2026;

8.uppose `expensive` is a function of one argument, an integer between 0 and 100 inclusive, that returns the result of a time-consuming com-putation. Define a function `frugal` that returns the same answer, but only calls `expensive` when given an argument it has not seen before.


<a id="org5f885a9"></a>

## Define a function like `apply`,&#x2026;

9.Define a function like `apply`, but where any number printed out before
it returns will be printed, by default, in octal(base 8)

